devoxx.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 15:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org67f9c9d">1. Day 1</a>
<ul>
<li><a href="#org644478d">1.1. From API to protocol</a>
<ul>
<li><a href="#org13acea7">1.1.1. Why build your own protocol?</a></li>
<li><a href="#orgd380c17">1.1.2. State machines as a base of a protocol</a></li>
<li><a href="#org3aa7aa1">1.1.3. Versioning of the protocol</a></li>
<li><a href="#orgaff5210">1.1.4. Error mgmt</a></li>
<li><a href="#orgdd557c5">1.1.5. Authentication and session</a></li>
<li><a href="#org103db56">1.1.6. Toolbox</a></li>
</ul>
</li>
<li><a href="#orgfba19c9">1.2. Functional patterns for scala beginners</a>
<ul>
<li><a href="#orgfcb1bd2">1.2.1. Programming with contextualized values</a></li>
<li><a href="#org8a804ef">1.2.2. Typeclasses</a></li>
<li><a href="#org45b5b08">1.2.3. Separate effects from logic</a></li>
</ul>
</li>
<li><a href="#org75e62ed">1.3. Scala in a corporate startup</a></li>
<li><a href="#org8a1b61c">1.4. Cassandra 101</a>
<ul>
<li><a href="#org12aaa35">1.4.1. Master/slave</a></li>
<li><a href="#org01f1ff9">1.4.2. P2P</a></li>
<li><a href="#org222ef29">1.4.3. Cassandra itself</a>
<ul>
<li><a href="#org7b87737">1.4.3.1. Parts taken from Dynamo</a></li>
<li><a href="#orgdb8534a">1.4.3.2. Tunable consistency</a></li>
<li><a href="#org55349a1">1.4.3.3. How Cassandra scales</a></li>
<li><a href="#orga26686b">1.4.3.4. Data modelling</a></li>
<li><a href="#org452349e">1.4.3.5. Query patterns</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#org78341a1">2. Day 2</a></li>
<li><a href="#org44cb8c6">3. Day 3</a>
<ul>
<li><a href="#org959fdae">3.1. Reliable micro services</a>
<ul>
<li><a href="#org1a44689">3.1.1. Fault tolerance</a></li>
</ul>
</li>
<li><a href="#org12af96f">3.2. Event sourcing &amp; functional programming</a>
<ul>
<li><a href="#org2134342">3.2.1. Event sourcing</a></li>
<li><a href="#org6149992">3.2.2. Implementing ES</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org67f9c9d" class="outline-2">
<h2 id="org67f9c9d"><span class="section-number-2">1</span> Day 1</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org644478d" class="outline-3">
<h3 id="org644478d"><span class="section-number-3">1.1</span> From API to protocol</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Push notifications are basically TCP long-term connections.
P2P in webRTC is a ton of hacks on top of HTTP and TCP.
An internal administration dashboard might be a good use case for SOAP due to its nature.
</p>
</div>

<div id="outline-container-org13acea7" class="outline-4">
<h4 id="org13acea7"><span class="section-number-4">1.1.1</span> Why build your own protocol?</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
sync vs async
streaming needs a new protocol
if you don't need guaranteed delivery, don't use TCP
different network topologies + IoT - devices that do not have to connect directly to the network
embedded
building over a communication channel - e.g. low-energy bluetooth
</p>
</div>
</div>

<div id="outline-container-orgd380c17" class="outline-4">
<h4 id="orgd380c17"><span class="section-number-4">1.1.2</span> State machines as a base of a protocol</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Having a state machine is a good idea to handle the intricacies of your protocol.
It's also wise to have a grammar for your protocol along with a parser for it.
</p>
</div>
</div>

<div id="outline-container-org3aa7aa1" class="outline-4">
<h4 id="org3aa7aa1"><span class="section-number-4">1.1.3</span> Versioning of the protocol</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
A protocol must be versioned.
Versioning enables protocol negotiation between server and client.
</p>
</div>
</div>

<div id="outline-container-orgaff5210" class="outline-4">
<h4 id="orgaff5210"><span class="section-number-4">1.1.4</span> Error mgmt</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Prefer error codes over error messages&#x2026; duh
</p>
</div>
</div>

<div id="outline-container-orgdd557c5" class="outline-4">
<h4 id="orgdd557c5"><span class="section-number-4">1.1.5</span> Authentication and session</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Session poisoning
</p>
</div>
</div>

<div id="outline-container-org103db56" class="outline-4">
<h4 id="org103db56"><span class="section-number-4">1.1.6</span> Toolbox</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
think of your API and code as protocols - do not just break stuff
make use of the state machine concept
experiment!
</p>
</div>
</div>
</div>

<div id="outline-container-orgfba19c9" class="outline-3">
<h3 id="orgfba19c9"><span class="section-number-3">1.2</span> Functional patterns for scala beginners</h3>
<div class="outline-text-3" id="text-1-2">
<p>
expressions
algebraic design - encoding knowledge into types and combinators before fleshing out concrete implementations of the primitives
ADTs
</p>
<ul class="org-ul">
<li>sum type or product type
<ul class="org-ul">
<li>product type is a multiplication of type values in a container such as a tuple, case class etc.: cardinality of a product type is the multiplication (product) of the cardinalities of its constituent types.</li>
<li>sum type - enums (e.g. boolean is an  enum comprised of  t &isin; {true, false}), JSON (null, string, array, obj, number, true, false) - the idea is that the number of types is limited.
<ul class="org-ul">
<li>in Scala, we model this with sealed traits</li>
<li>cardinality of a sum type is the sum of the cardinalities of its constituent types.</li>
</ul></li>
</ul></li>
</ul>
<ul class="org-ul">
<li>OOP: easy to add cases</li>
<li>FP: easy to add functions</li>
</ul>

<p>
Two things that have the same structure are isomorphic. 
Associativity&#x2026;
Distributing multiplication over addition&#x2026; ("X", Right(42)) -&gt; Right(("X", 42))
c<sup>(a+b)</sup> &lt;=&gt; c<sup>a</sup> * c<sup>b</sup> -&gt; case analysis encoding
boolean blindness -&gt; <a href="https://shreevatsa.wordpress.com/2015/01/31/boolean-blindness/">https://shreevatsa.wordpress.com/2015/01/31/boolean-blindness/</a>
</p>
</div>
<div id="outline-container-orgfcb1bd2" class="outline-4">
<h4 id="orgfcb1bd2"><span class="section-number-4">1.2.1</span> Programming with contextualized values</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Options (Maybe monad in Haskell)</li>
<li>Eithers etc.</li>
<li>scalaz.\/ : has type disjunction, is unbiased as well as eithers</li>
</ul>

<p>
Both Either and \/ fail fast - use scalaz.Validation for accumulating errors.
 has types successNel and failureNel (non-empty list)
</p>
</div>
</div>

<div id="outline-container-org8a804ef" class="outline-4">
<h4 id="org8a804ef"><span class="section-number-4">1.2.2</span> Typeclasses</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Monoid - Big Data typeclass :)
Monoid as a parameterized trait and implementations for types as classes.
Automatic wiring through implicits
</p>

<p>
typeclass convergence problem - it is a good practice to have one implementation of a behavior for a type. If you have multiple behaviors, it's reasonable to create type wrappers which are removed during compilation.
</p>
</div>
</div>

<div id="outline-container-org45b5b08" class="outline-4">
<h4 id="org45b5b08"><span class="section-number-4">1.2.3</span> Separate effects from logic</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Kleisli categories
Encode effects description as an ADT
Execute effects "at the end of the world"
</p>
</div>
</div>
</div>

<div id="outline-container-org75e62ed" class="outline-3">
<h3 id="org75e62ed"><span class="section-number-3">1.3</span> Scala in a corporate startup</h3>
<div class="outline-text-3" id="text-1-3">
<p>
compilation times are a pain
<a href="https://www.chrisstucchio.com/blog/2014/bondage_and_discipline.html">https://www.chrisstucchio.com/blog/2014/bondage_and_discipline.html</a>
</p>


<p>
Pretty good arguments against Scala
Scala code often turns into poetry and writing a project is a collaboration effort, not a beauty competition :)
"Any fool can write code that a computer can understand. Good programmers write code that humans can understand. " - M. Fowler
</p>

<p>
Don't develop in Scala when you'll have to package it in an OSGi bundle with Java modules.
</p>
</div>
</div>
<div id="outline-container-org8a1b61c" class="outline-3">
<h3 id="org8a1b61c"><span class="section-number-3">1.4</span> Cassandra 101</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Datastax
Cassandra is:
</p>
<ul class="org-ul">
<li>a shared nothing masterless datastore</li>
<li>highly oriented on availability (AP over C unless you use lightweight transactions which is turning Cassandra around)</li>
<li>biggest mindset change is learning to model differently ("I only want it to go to a single server regardless of the cluster size")</li>
</ul>
</div>

<div id="outline-container-org12aaa35" class="outline-4">
<h4 id="org12aaa35"><span class="section-number-4">1.4.1</span> Master/slave</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Master serves all writes -&gt; fault -&gt; re-election
read from master and optionally slave
Scaling writes with M/S needs sharding
</p>
</div>
</div>
<div id="outline-container-org01f1ff9" class="outline-4">
<h4 id="org01f1ff9"><span class="section-number-4">1.4.2</span> P2P</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
no master
read/write to any
eventual consistency (duh)
</p>
</div>
</div>
<div id="outline-container-org222ef29" class="outline-4">
<h4 id="org222ef29"><span class="section-number-4">1.4.3</span> Cassandra itself</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Biggest users - Apple, Spotify, banking, IoT apps
Based on Dynamo and BigTable (column family data model) papers
Cassandra has multi data center support built in from the start - They don't have to be real data centers though, you can designate nodes to different uses, e.g. user-facing and containing the replicated data for spark
</p>
</div>
<div id="outline-container-org7b87737" class="outline-5">
<h5 id="org7b87737"><span class="section-number-5">1.4.3.1</span> Parts taken from Dynamo</h5>
