devoxx.html
<div class="outline-text-5" id="text-1-4-3-1">
</div><ol class="org-ol"><li><a id="org1b26b71"></a>Consistent hashing<br  /><div class="outline-text-6" id="text-1-4-3-1-1">
<p>
You don't want a full table scan on a 1000 node cluster
Availability + Partition tolerance: replication
</p>

<p>
Cassandra takes a column (partition key) and hashes them using an algorithm such as murmur3, each node of the cluster owns a range of hash keys this gives a more even spread of data.
In the background, nodes exchange state information through gossip protocol (with the client as well), adjusting hash ranges and data distribution.
</p>
</div></li>

<li><a id="orgb2ccdc1"></a>Replication<br  /><div class="outline-text-6" id="text-1-4-3-1-2">
<ol class="org-ol">
<li>simple replication - give it a number and Cassandra will replicate data that many times (select a hash and replicate to next n-1 adjacent nodes)</li>
<li><p>
NetworkTopology
</p>
<ul class="org-ul">
<li>you need to be topology aware</li>
<li>failures occur mostly between data centers, between racks etc.</li>
<li>every Cassandra node must know its data center and rack</li>
<li>replicas won't be put on the same ruck unless Replication Factor &gt; # of racks</li>
</ul>
<p>
You can select a coordinator for each data center Cassandra runs on (e.g. based on latency). It is not a special node, it just does one additional request related to &#x2026;
When replicating between remote data centers, Cassandra will replicate data only to one node in a remote DC, the rest is left up to gossip.
Cassandra requires you to describe the required consistency of each query.
</p></li>
</ol>
</div></li></ol>
</div>
<div id="outline-container-orgdb8534a" class="outline-5">
<h5 id="orgdb8534a"><span class="section-number-5">1.4.3.2</span> Tunable consistency</h5>
<div class="outline-text-5" id="text-1-4-3-2">
<p>
Data is replicated N times.
Every query you need to give consistency:
</p>
<ul class="org-ul">
<li>ALL</li>
<li>QUORUM</li>
<li>LOCAL<sub>QUORUM</sub></li>
<li>ONE</li>
</ul>

<p>
<a href="http://planetcassandra.org/blog/a-netflix-experiment-eventual-consistency-hopeful-consistency-by-christos-kalantzis/">http://planetcassandra.org/blog/a-netflix-experiment-eventual-consistency-hopeful-consistency-by-christos-kalantzis/</a>
</p>

<p>
Lightweight transactions - Cassandra can use Paxos to maintain consistency, but this is consequential and goes rather against the idea of Cassandra.
</p>
</div>
</div>

<div id="outline-container-org55349a1" class="outline-5">
<h5 id="org55349a1"><span class="section-number-5">1.4.3.3</span> How Cassandra scales</h5>
<div class="outline-text-5" id="text-1-4-3-3">
<p>
Throw more nodes at a cluster
Bootstrapping + joining the ring (this can take some time for large data sets)
</p>
<ul class="org-ul">
<li>gossiping the join</li>
<li>small pieces of data are transferred to the new nodes</li>
<li>the new nodes do not service requests until they are fully bootstrapped</li>
<li>the completion of the bootstrap process is announced to the rest of the system</li>
</ul>
</div>
</div>

<div id="outline-container-orga26686b" class="outline-5">
<h5 id="orga26686b"><span class="section-number-5">1.4.3.4</span> Data modelling</h5>
<div class="outline-text-5" id="text-1-4-3-4">
<p>
CQL language - looks similar to SQL but forget normalization data modelling concepts - denormalisation is the key to performance with Cassandra
A big part of the idea is to store it as close as possible to how you need it to be used.
</p>

<p>
Cassandra cannot join/aggregate -
</p>

<p>
Keyspace - analogous to a schema. Also, it determines the replication factor.
Tables looks similarly to SQL tables.
Cassandra limits stuff you can do to things that can be satisfied on a single node,
</p>

<p>
UUID - like in dynamo
</p>
</div>

<ol class="org-ol"><li><a id="orgad85d65"></a>User defined types<br  /><div class="outline-text-6" id="text-1-4-3-4-1">
<p>
Every time you want to do a JOIN, think a type in your table.
</p>
<ul class="org-ul">
<li>complex data in one place</li>
<li>no multi-gets (multi-partitions)</li>
<li>nesting</li>
</ul>
</div></li></ol>
</div>

<div id="outline-container-org452349e" class="outline-5">
<h5 id="org452349e"><span class="section-number-5">1.4.3.5</span> Query patterns</h5>
<div class="outline-text-5" id="text-1-4-3-5">
<p>
Selecting a primary key determines how you can query it
If you use timestamps in a primary key, it's useful to take into account sorting ing the data (WITH CLUSTERING ORDER BY (timestamp DESC&#x2026;))
according to how you want to use it, e.g. use DESC when most recent data is more important.
</p>

<p>
Range queries, "slice" operations on disk.
</p>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org78341a1" class="outline-2">
<h2 id="org78341a1"><span class="section-number-2">2</span> Day 2</h2>
<div class="outline-text-2" id="text-2">
<p>
Nothing really interesting&#x2026;
</p>
</div>
</div>


<div id="outline-container-org44cb8c6" class="outline-2">
<h2 id="org44cb8c6"><span class="section-number-2">3</span> Day 3</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org959fdae" class="outline-3">
<h3 id="org959fdae"><span class="section-number-3">3.1</span> Reliable micro services</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Tools: hystrix, graphite, saboteur (injecting failures into the network) <a href="https://github.com/tomakehurst/saboteur">https://github.com/tomakehurst/saboteur</a>, nagios
Test double - wiremock for HTTP, stubbed database for Cassandra
Kafka Unit
Book: Release It! by Michael T. Nygard
</p>

<p>
Isolated service tests - unit tests taken a step further
</p>
</div>

<div id="outline-container-org1a44689" class="outline-4">
<h4 id="org1a44689"><span class="section-number-4">3.1.1</span> Fault tolerance</h4>
<div class="outline-text-4" id="text-3-1-1">
<ol class="org-ol">
<li>Implement timeouts, do not wait forever - multiple waiting requests build up and can cause snowballing failures.
test for slow packets
use vagrant + saboteur + wiremock + acceptance tests
  use tc through saboteur to slow each TCP packet down by some time
  the code is on GH
you can't use network-level timeouts for SLAs - dependencies might be garbage collecting etc</li>

<li>Don't try if you can't succeed
unbounded queues are not good for sudden load spikes - use a bounded queue and fail fast and gracefully when it's over the limit.
Look for configuration options that allow queue size limiting, if you don';t find one, move on to another library.</li>

<li>Fail gracefully
expect invalid HTTP, malformed response bodies, connection failures. huge/tiny responses
wiremock programmatic API</li>
<li><p>
Know if it's your fault
</p>
<ul class="org-ul">
<li>coda hale metrics (timings, errors)</li>
<li>concurrent incoming requests</li>
<li>thread pool statistics</li>
<li>connection pool sizes</li>
<li>Boundary logging, ElasticSearch / Logstash</li>
<li>request identifiers</li>
<li>tool: <a href="https://github.com/twitter/zipkin">https://github.com/twitter/zipkin</a></li>
</ul>
<ol class="org-ol">
<li><p>
Don't whack a dead horse
</p>
<ul class="org-ul">
<li>fail gracefully and really fast or throttle requests</li>
<li>use the circuit breaker pattern
put dangerous (potentially failing) code into a Hystrix command - you could then use the `.execute` method or various async options such as callbacks or observables.</li>
</ul>
<ol class="org-ol">
<li>Turn broken stuff off
<ul class="org-ul">
<li>encode ways to safely turn features off (simple stuff like defaulting someting to true etc.)</li>
</ul></li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org12af96f" class="outline-3">
<h3 id="org12af96f"><span class="section-number-3">3.2</span> Event sourcing &amp; functional programming</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Nice observation - the more generic the type pattern the more constrained and clear the operations you can express.
</p>

<p>
Why Functional Programming Matters, J. Hughes
Program Design by Calculation, J.N. Oliveira
A lengthy approach to Haskell fundamentals
</p>

<p>
functional state, return modified state instances tupled with results.
basic stuff for monadic state
</p>
</div>

<div id="outline-container-org2134342" class="outline-4">
<h4 id="org2134342"><span class="section-number-4">3.2.1</span> Event sourcing</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
event sourcing is driven by business - a specific need has arisen that is naturally satisfied by event sourcing.
bloggers conf app on github - rabbitonweb, pawelszulc?
</p>

<p>
aggregating events happening in the system and deriving the data model structure from them
the only model that does not lose any data - the most basic representation of data possible thus allowing to do the most things on top of it.
</p>

<p>
Benefits of ES: time travelling, measurements, comparisons, built-in audit log, temporal querying, fits well with machine learning.
Drawbacks of ES: historical record of bad decisions, handling duplicated events, data is eventually consistent.
</p>
</div>
</div>
